In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('transfeminicides_world.csv')

In [4]:
df1 = pd.read_csv('violence_against_LBTwomen_EU.csv')

In [5]:
df.head()

                                 Name Country   Latitude  Longitude   Category
0                         Rita Hester     USA  42.358894 -71.056742    stabbed
1  Lauryn Paige (Donald Scott Fuller)     USA  30.264979 -97.746598    stabbed
2                         Robert Eads     USA  33.748547 -84.391502     cancer
3                 Steve Dwayne Garcia     USA  29.760803 -95.369506       shot
4       Chris Muzett (Eddie Matthews)     USA  42.332916 -83.047853  strangled

In [6]:
df1.head()

,CountryCode,question_label,subset,answer,percentage
0,Austria,Avoid holding hands in public with a same-sex ...,Lesbian,Yes,33
1,Austria,Avoid holding hands in public with a same-sex ...,Lesbian,No,53
2,Austria,Avoid holding hands in public with a same-sex ...,Lesbian,I do not have a same-sex partner,12
3,Austria,Avoid holding hands in public with a same-sex ...,Lesbian,Don't know,2
4,Belgium,Avoid holding hands in public with a same-sex ...,Lesbian,Yes,43

In [7]:
df.describe()

          Latitude    Longitude
count  3679.000000  3679.000000
mean      4.619288   -51.632916
std      23.528035    48.957939
min     -53.785464  -157.869285
25%     -16.736246   -84.922499
50%       4.396070   -55.636140
75%      21.069840   -40.647498
max      60.485643   178.416595

In [8]:
df1.describe()

       percentage
count   839.00000
mean     33.83671
std      25.45750
min       0.00000
25%       9.00000
50%      33.00000
75%      54.00000
max      93.00000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3679 entries, 0 to 3678
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       3679 non-null   object
 1   Country    3679 non-null   object
 2   Latitude   3679 non-null   float64
 3   Longitude  3679 non-null   float64
 4   Category   3679 non-null   object
dtypes: float64(2), object(3)
memory usage: 143.8+ KB

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 839 entries, 0 to 838
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CountryCode     839 non-null    object
 1   question_label  839 non-null    object
 2   subset          839 non-null    object
 3   answer          839 non-null    object
 4   percentage      839 non-null    int64
dtypes: int64(1), object(4)
memory usage: 32.9+ KB

In [11]:
df = df.drop_duplicates()

In [12]:
df1 = df1.drop_duplicates()

In [13]:
print(df.isnull().sum())
print(df1.isnull().sum())

Name         0
Country      0
Latitude     0
Longitude    0
Category     0
dtype: int64
CountryCode       0
question_label    0
subset            0
answer            0
percentage        0
dtype: int64